Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/Business_Resources/dataCapture/AutorizacionDataCapture/autorizacionDataCapturePS.wsdl

<wsdl:definitions name="autorizacionDataCapturePS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/autorizacionDataCapturePS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/autorizacionDataCapturePS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/autorizacionDataCaptureTypes">

  <wsdl:types>
    <xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
	</xsd:schema>
	<xsd:schema>
		<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autorizacionDataCaptureTypes" schemaLocation="autorizacionDataCaptureTypes.xsd"/>
	</xsd:schema>
  </wsdl:types>
  
  	<wsdl:message name="autorizacionDataCaptureRequest">
		<wsdl:part element="cons:autorizacionDataCapture" name="parameters"/>
		<wsdl:part name="AutenticacionRequestHeader" element="auth:AutenticacionRequestHeader"/>
	</wsdl:message>
	<wsdl:message name="autorizacionDataCaptureResponse">
		<wsdl:part element="cons:autorizacionDataCaptureResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>
		
	<wsdl:portType name="autorizacionDataCapturePS">
		<wsdl:operation name="autorizacionDataCapture" parameterOrder="parameters AutenticacionRequestHeader ResponseHeader">
			<wsdl:input message="fic:autorizacionDataCaptureRequest"/>
			<wsdl:output message="fic:autorizacionDataCaptureResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="autorizacionDataCapturePSSOAP" type="fic:autorizacionDataCapturePS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="autorizacionDataCapture">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/autorizacionDataCapturePS/autorizacionDataCapture"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:autorizacionDataCaptureRequest" part="AutenticacionRequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:autorizacionDataCaptureResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
  
  <wsdl:service name="autorizacionDataCapturePS">
    <wsdl:port binding="fic:autorizacionDataCapturePSSOAP" name="autorizacionDataCapturePSSOAP">
      <soap:address location="http://mwinterbanca:8003/Middleware/OperationsAndExecution/CustomerDeposits/AutorizacionDataCapture"/>
    </wsdl:port>
  </wsdl:service>
  
</wsdl:definitions>